Autodesk.Revit.Exceptions.FileArgumentNotFoundException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.FileArgumentNotFoundException
The exception that is thrown when a method received a filename as an argument and requires it to exist as a precondition.